## Simple Queries

In [1]:
-- 1. LIST ALL THE EMPLOYEE DETAILS.
SELECT * FROM EMPLOYEE

Employee_ID,Last_Name,First_Name,Middle_Name,Job_ID,Manager_ID,Hire_Date,Salary,Comm,Department_ID
7369,SMITH,JOHN,Q,667,7902,1984-12-17,800.00,NULL,20
7499,ALLEN,KEVIN,J,670,7698,1985-02-20,1600.00,300,30
7505,DOYLE,JEAN,K,671,7839,1985-04-04,2850.00,NULL,30
7506,DENNIS,LYNN,S,671,7839,1985-05-15,2750.00,NULL,30
7507,BAKER,LESLIE,D,671,7839,1985-06-10,2200.00,NULL,40
7521,WARK,CYNTHIA,D,670,7698,1985-02-22,1250.00,500,30

In [2]:
-- 2. LIST ALL THE DEPARTMENT DETAILS
SELECT * FROM DEPARTMENT

DEPARTMENT_ID,NAME,LOCATION_ID
10,Accounting,122
20,Sales,124
30,Research,123
40,Operations,167

In [3]:
-- 3. LIST ALL JOB DETAILS.
SELECT * FROM JOB

JOB_ID,DESIGNATION
667,Clerk
668,Staff
669,Analyst
670,Sales Person
671,Manager
672,President

In [4]:
-- 4. LIST ALL THE LOCATIONS.
SELECT * FROM LOCATION

LOCATION_ID,CITY
122,New York
123,Dallas
124,Chicago
167,Boston

In [5]:
-- 5. LIST OUT THE FIRSTNAME, LASTNAME, SALARY, COMMISSION FOR ALL EMPLOYEES.
SELECT FIRST_NAME, LAST_NAME, SALARY, COMM FROM EMPLOYEE

FIRST_NAME,LAST_NAME,SALARY,COMM
JOHN,SMITH,800.00,NULL
KEVIN,ALLEN,1600.00,300
JEAN,DOYLE,2850.00,NULL
LYNN,DENNIS,2750.00,NULL
LESLIE,BAKER,2200.00,NULL
CYNTHIA,WARK,1250.00,500

In [7]:
-- 6. LIST OUT EMPLOYEEID,LAST NAME, DEPARTMENT ID FOR ALL EMPLOYEES AND ALIAS
-- EMPLOYEEID AS "ID OF THE EMPLOYEE", LAST NAME AS "NAME OF THE EMPLOYEE",
-- DEPARTMENTID AS "DEP_ID".

SELECT Employee_ID AS "ID OF THE EMPLOYEE", LAST_NAME "NAME OF THE EMPLOYEE", DEPARTMENT_ID "DEP_ID"
FROM EMPLOYEE

ID OF THE EMPLOYEE,NAME OF THE EMPLOYEE,DEP_ID
7369,SMITH,20
7499,ALLEN,30
7505,DOYLE,30
7506,DENNIS,30
7507,BAKER,40
7521,WARK,30

In [12]:
-- 7. LIST OUT THE EMPLOYEES ANNUAL SALARY WITH THEIR NAMES ONLY.
SELECT FIRST_NAME, SALARY*12 AS "ANNUAL SALARY" FROM EMPLOYEE

FIRST_NAME,ANNUAL SALARY
JOHN,9600.00
KEVIN,19200.00
JEAN,34200.00
LYNN,33000.00
LESLIE,26400.00
CYNTHIA,15000.00

## WHERE

In [11]:
-- 1. LIST THE DETAILS ABOUT "SMITH"
SELECT * FROM EMPLOYEE WHERE 'SMITH' in (First_Name,Last_Name)

Employee_ID,Last_Name,First_Name,Middle_Name,Job_ID,Manager_ID,Hire_Date,Salary,Comm,Department_ID
7369,SMITH,JOHN,Q,667,7902,1984-12-17,800.00,NULL,20

In [14]:
-- 2. LIST OUT THE EMPLOYEES WHO ARE WORKING IN DEPARTMENT 20.
SELECT * FROM EMPLOYEE WHERE Department_ID=20

Employee_ID,Last_Name,First_Name,Middle_Name,Job_ID,Manager_ID,Hire_Date,Salary,Comm,Department_ID
7369,SMITH,JOHN,Q,667,7902,1984-12-17,800.00,NULL,20

In [19]:
-- 3. LIST OUT THE EMPLOYEES WHO ARE EARNING SALARY BETWEEN 3000 AND 4500.
SELECT * FROM EMPLOYEE WHERE Salary BETWEEN 3000 AND 4500

In [20]:
-- 4. LIST OUT THE EMPLOYEES WHO ARE WORKING IN DEPARTMENT 10 OR 20.
SELECT * FROM EMPLOYEE WHERE Department_ID IN (10,20)

Employee_ID,Last_Name,First_Name,Middle_Name,Job_ID,Manager_ID,Hire_Date,Salary,Comm,Department_ID
7369,SMITH,JOHN,Q,667,7902,1984-12-17,800.00,NULL,20

In [21]:
-- 5. FIND OUT THE EMPLOYEES WHO ARE NOT WORKING IN DEPARTMENT 10 OR 30.
SELECT * FROM EMPLOYEE WHERE Department_ID NOT IN (10,30)

Employee_ID,Last_Name,First_Name,Middle_Name,Job_ID,Manager_ID,Hire_Date,Salary,Comm,Department_ID
7369,SMITH,JOHN,Q,667,7902,1984-12-17,800.00,NULL,20
7507,BAKER,LESLIE,D,671,7839,1985-06-10,2200.00,NULL,40

In [24]:
-- 6. LIST OUT THE EMPLOYEES WHOSE NAME STARTS WITH 'S'.
SELECT * FROM EMPLOYEE WHERE First_Name LIKE 'S%' OR Last_Name LIKE 'S%'

Employee_ID,Last_Name,First_Name,Middle_Name,Job_ID,Manager_ID,Hire_Date,Salary,Comm,Department_ID
7369,SMITH,JOHN,Q,667,7902,1984-12-17,800.00,NULL,20

In [25]:
-- 7. LIST OUT THE EMPLOYEES WHOSE NAME STARTS WITH 'S' AND ENDS WITH 'H'.
SELECT *
FROM EMPLOYEE
WHERE (First_Name LIKE 'S%H' OR Last_Name LIKE 'S%H')

Employee_ID,Last_Name,First_Name,Middle_Name,Job_ID,Manager_ID,Hire_Date,Salary,Comm,Department_ID
7369,SMITH,JOHN,Q,667,7902,1984-12-17,800.00,NULL,20

In [26]:
-- 8. LIST OUT THE EMPLOYEES WHOSE NAME LENGTH IS 4 AND START WITH 'S'.
SELECT *
FROM EMPLOYEE
WHERE 4 IN (LEN(First_Name),LEN(LAST_NAME)) AND (First_Name LIKE 'S%' OR Last_Name LIKE 'S%')

Employee_ID,Last_Name,First_Name,Middle_Name,Job_ID,Manager_ID,Hire_Date,Salary,Comm,Department_ID
7369,SMITH,JOHN,Q,667,7902,1984-12-17,800.00,NULL,20

In [27]:
-- 9. LIST OUT EMPLOYEES WHO ARE WORKING IN DEPARRTMENT 10 AND DRAW THE
-- SALARIES MORE THAN 3500.

SELECT * FROM EMPLOYEE WHERE Department_ID=10 AND Salary>3500

In [28]:
-- 10. LIST OUT THE EMPLOYEES WHO ARE NOT RECEVING COMMISSION.
SELECT * FROM EMPLOYEE WHERE COMM IS NULL

Employee_ID,Last_Name,First_Name,Middle_Name,Job_ID,Manager_ID,Hire_Date,Salary,Comm,Department_ID
7369,SMITH,JOHN,Q,667,7902,1984-12-17,800.00,NULL,20
7505,DOYLE,JEAN,K,671,7839,1985-04-04,2850.00,NULL,30
7506,DENNIS,LYNN,S,671,7839,1985-05-15,2750.00,NULL,30
7507,BAKER,LESLIE,D,671,7839,1985-06-10,2200.00,NULL,40

## ORDER BY CLAUSE

In [30]:
-- 1. LIST OUT THE EMPLOYEE ID, LAST NAME IN ASCENDING ORDER BASED ON THE EMPLOYEE ID.
SELECT Employee_ID, LAST_NAME FROM EMPLOYEE ORDER BY Employee_ID

Employee_ID,LAST_NAME
7369,SMITH
7499,ALLEN
7505,DOYLE
7506,DENNIS
7507,BAKER
7521,WARK

In [31]:
-- 2. LIST OUT THE EMPLOYEE ID, NAME IN DESCENDING ORDER BASED ON SALARY.
SELECT Employee_ID, First_Name AS [NAME]
FROM EMPLOYEE
ORDER BY Salary DESC

Employee_ID,NAME
7505,JEAN
7506,LYNN
7507,LESLIE
7499,KEVIN
7521,CYNTHIA
7369,JOHN

In [32]:
-- 3. LIST OUT THE EMPLOYEE DETAILS ACCORDING TO THEIR LAST-NAME IN ASCENDING ORDER
SELECT * FROM EMPLOYEE ORDER BY Last_Name

Employee_ID,Last_Name,First_Name,Middle_Name,Job_ID,Manager_ID,Hire_Date,Salary,Comm,Department_ID
7499,ALLEN,KEVIN,J,670,7698,1985-02-20,1600.00,300,30
7507,BAKER,LESLIE,D,671,7839,1985-06-10,2200.00,NULL,40
7506,DENNIS,LYNN,S,671,7839,1985-05-15,2750.00,NULL,30
7505,DOYLE,JEAN,K,671,7839,1985-04-04,2850.00,NULL,30
7369,SMITH,JOHN,Q,667,7902,1984-12-17,800.00,NULL,20
7521,WARK,CYNTHIA,D,670,7698,1985-02-22,1250.00,500,30

In [33]:
-- 4. LIST OUT THE EMPLOYEE DETAILS ACCORDING TO THEIR LAST-NAME IN ASCENDING ORDER AND
-- THEN ON DEPARTMENT_ID IN DESCENDING ORDER.
SELECT * FROM EMPLOYEE ORDER BY Last_Name, Department_ID DESC

Employee_ID,Last_Name,First_Name,Middle_Name,Job_ID,Manager_ID,Hire_Date,Salary,Comm,Department_ID
7499,ALLEN,KEVIN,J,670,7698,1985-02-20,1600.00,300,30
7507,BAKER,LESLIE,D,671,7839,1985-06-10,2200.00,NULL,40
7506,DENNIS,LYNN,S,671,7839,1985-05-15,2750.00,NULL,30
7505,DOYLE,JEAN,K,671,7839,1985-04-04,2850.00,NULL,30
7369,SMITH,JOHN,Q,667,7902,1984-12-17,800.00,NULL,20
7521,WARK,CYNTHIA,D,670,7698,1985-02-22,1250.00,500,30

## GROUP BY & HAVING CLAUSE
hint keywords - wise

In [36]:
-- 1. HOW MANY EMPLOYEES WHO ARE IN DIFFERENT DEPARTMENTS WISE IN THE ORGANIZATION.
SELECT Department_ID, COUNT(*) AS EMP_COUNT FROM EMPLOYEE GROUP BY Department_ID

Department_ID,EMP_COUNT
20,1
30,4
40,1

In [40]:
-- 2. LIST OUT THE DEPARTMENT WISE MAXIMUM SALARY, MINIMUM SALARY, AVERAGE SALARY OF
-- THE EMPLOYEES.
SELECT Department_ID, MAX(Salary) AS MAX_SAL, MIN(Salary) AS MIN_SAL, AVG(Salary) AS AVG_SAL
FROM EMPLOYEE GROUP BY Department_ID

Department_ID,MAX_SAL,MIN_SAL,AVG_SAL
20,800.00,800.00,800.00
30,2850.00,1250.00,2112.50
40,2200.00,2200.00,2200.00

In [41]:
-- 3. LIST OUT JOB WISE MAXIMUM SALARY, MINIMUM SALARY, AVERAGE SALARIES OF THE
-- EMPLOYEES.
SELECT Job_ID, MAX(Salary) AS MAX_SAL, MIN(Salary) AS MIN_SAL, AVG(Salary) AS AVG_SAL
FROM EMPLOYEE GROUP BY Job_ID

Job_ID,MAX_SAL,MIN_SAL,AVG_SAL
667,800.00,800.00,800.00
670,1600.00,1250.00,1425.00
671,2850.00,2200.00,2600.00

In [46]:
-- 4. LIST OUT THE NUMBER OF EMPLOYEES JOINED IN EVERY MONTH IN ASCENDING ORDER.
SELECT DATENAME(MM,Hire_Date) AS JOINING_MONTH, COUNT(*) AS NO_OF_EMPLOYEE FROM EMPLOYEE GROUP BY DATENAME(MM,Hire_Date) ORDER BY DATENAME(MM,Hire_Date)

JOINING_MONTH,NO_OF_EMPLOYEE
April,1
December,1
February,2
June,1
May,1

In [63]:
-- 5. LIST OUT THE NUMBER OF EMPLOYEES FOR EACH MONTH AND YEAR, IN THE ASCENDING
-- ORDER BASED ON THE YEAR, MONTH.
SELECT MONTH(Hire_Date) AS [MONTH], YEAR(Hire_Date) AS [YEAR], COUNT(*) AS EMP_COUNT
FROM EMPLOYEE
GROUP BY MONTH(Hire_Date),YEAR(Hire_Date)
ORDER BY MONTH(Hire_Date),YEAR(Hire_Date)

MONTH,YEAR,EMP_COUNT
2,1985,2
4,1985,1
5,1985,1
6,1985,1
12,1984,1

In [52]:
-- 6. LIST OUT THE DEPARTMENT ID HAVING ATLEAST FOUR EMPLOYEES.
SELECT Department_ID,COUNT(*) AS NO_OF_EMP FROM EMPLOYEE GROUP BY Department_ID HAVING COUNT(*) >=4

Department_ID,NO_OF_EMP
30,4

In [59]:
-- 7. HOW MANY EMPLOYEES JOINED IN JANUARY MONTH.
SELECT COUNT(*) AS EMP_JOINED_IN_JAN FROM EMPLOYEE WHERE DATENAME(MM,Hire_Date)='Jan'

EMP_JOINED_IN_JAN
0

In [70]:
-- 8. HOW MANY EMPLOYEES JOINED IN JANUARY OR SEPTEMBER MONTH.
SELECT COUNT(*) AS EMP_JOINED_IN_JAN FROM EMPLOYEE WHERE MONTH(Hire_Date) IN (1,9)

EMP_JOINED_IN_JAN
0

In [71]:
-- 9. HOW MANY EMPLOYEES WERE JOINED IN 1985?
SELECT YEAR(Hire_Date),COUNT(*) AS EMP_JOINED_IN_1985 FROM EMPLOYEE WHERE YEAR(Hire_Date)=1985

EMP_JOINED_IN_1985
5

In [81]:
-- 10. HOW MANY EMPLOYEES WERE JOINED EACH MONTH IN 1985.

SELECT DATENAME(MM,Hire_Date) AS [MONTH],COUNT(*) AS EMP_JOINED_IN_1985
FROM EMPLOYEE
GROUP BY YEAR(Hire_Date), DATENAME(MM,Hire_Date)
HAVING YEAR(Hire_Date)=1985

MONTH,EMP_JOINED_IN_1985
April,1
February,2
June,1
May,1

In [91]:
-- 11. HOW MANY EMPLOYEES WERE JOINED IN MARCH 1985?
SELECT DATENAME(MM,Hire_Date) AS [MONTH],COUNT(*) AS EMP_JOINED_IN_1985
FROM EMPLOYEE
GROUP BY YEAR(Hire_Date), DATENAME(MM,Hire_Date)
HAVING YEAR(Hire_Date)=1985 AND DATENAME(MM,Hire_Date)='MAR'

In [90]:
-- 12. WHICH IS THE DEPARTMENT ID, HAVING GREATER THAN OR EQUAL TO 3 EMPLOYEES JOINED IN
-- APRIL 1985?
SELECT Department_ID, COUNT(*) AS EMP_COUNT
FROM EMPLOYEE
GROUP BY Department_ID,YEAR(Hire_Date), MONTH(Hire_Date)
HAVING YEAR(Hire_Date)=1985 AND MONTH(Hire_Date)=4 AND COUNT(*)>=3

## JOINS